tutorials/rhopSonicFoam/shockTube/0.org/rhoU
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.1                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -2 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    sides           
    {
        type            zeroGradient;
    }

    empty           
    {
        type            empty;
    }
}


// ************************************************************************* //
